www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients(){

      $data = [
          'arrayClients' => $this->clientModel->findAll()
      ];
---
SELECT *
FROM `clients`

    public function consultClients($idClient){
      if($this->clientModel->find([$idClient])){
        $data = [
          'arrayClient' => $this->clientModel->find([$idClient])
        ];
---
SELECT *
FROM `clients`
WHERE `clients`.`idClient` IN ('52')

    public function deleteClient($idClient){

      $this->clientModel->delete($idClient);
---
DELETE FROM `clients`
WHERE `idClient` IN ('3')