www/codeigniter4/app/Controllers/Admin/Client.php

  public function listClients(){
      $data = [
          'clients' => $this->clientModel->findAll()
      ];
---
SELECT *
FROM `clients`

    public function registerClients(){
      echo view('admin/templates/header');
      echo view('admin/templates/offcanva');
      echo view('admin/clients/registerClients');
      echo view('admin/templates/footer');


      if($this->request->getVar('submit') == ""){

        $this->clientModel->save($this->request->getPost());
---
INSERT INTO `clients` (`name`, `phone`, `email`, `address`) VALUES ('Eduardo Barbosa Bernardes', '51980617496', 'eduardobb@redeulbra.br', 'Rua Sao Paulo, 875, Guará')

    public function consultClients($idClient){
      if($this->clientModel->find([$idClient])){
        $data = [
          'clients' => $this->clientModel->find([$idClient])
        ];
---
SELECT *
FROM `clients`
WHERE `clients`.`idClient` IN ('8')