www/codeigniter4/app/Controllers/Admin/Contact.php

INSERT INTO `contacts` (`name`, `email`, `status`, `message`, `description`) VALUES ('Eduardo Barbosa Bernardes', 'eduardobb@redeulbra.br', '7968', 'dghfh', 'gjkgl')
---
  public function registerContacts(){
        echo view('admin/templates/header');
        echo view('admin/templates/offcanva');
        echo view('admin/contacts/registerContacts');
        echo view('admin/templates/footer');

        $this->contactModel->save($this->request->getPost());