www/codeigniter4/app/Controllers/Admin/Product.php

SELECT *
FROM `products`
---
    public function listProducts(){

      $data = [

          'arrayProducts' => $this->productModel->findAll()
      ];

UPDATE `products` SET `name` = 'detergente', `price` = '13,09', `description` = 'toop', `idCategory` = '9000'
WHERE `products`.`idProduct` IN ('1')
---
    public function updateProducts($idProduct){

      $data = [
          'name' => $this->request->getPost('name'),
          'price' => $this->request->getPost('price'),
          'description' => $this->request->getPost('description'),
          'idCategory' => $this->request->getPost('category')
      ];
      $this->productModel->update($idProduct,$data);

DELETE FROM `products`
WHERE `idProduct` IN ('5')
---
    public function deleteProducts($idProduct){
      $this->productModel->delete($idProduct);